[
  {
    "id": 1,
    "name": "Find the pair",
    "tags": ["REACT"],
    "description": "In this project, I was practice my knowledge after been completed the course of react. It is a simple game that you need to find its pair of multiple cards, using the api Rick & Morty to decorate each card with theirs characters.",
    "demo": "https://zen-shockley-02f050.netlify.app/",
    "code": "https://github.com/ProjectXfire/find_the_pair",
    "image": "img/project_1.jpg"
  },
  {
    "id": 2,
    "name": "404 Not found",
    "tags": ["HTML", "CSS", "RESPONSIVE"],
    "description": "In this project, I was practice my HTML and CSS, making it responsive in differents screens sizes. The design was provided by devChallenges.io.",
    "demo": "https://zen-borg-67a721.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_404_not_found",
    "image": "img/project_2.jpg"
  },
  {
    "id": 3,
    "name": "Recipes",
    "tags": ["HTML", "CSS", "RESPONSIVE"],
    "description": "In this project, I was practice my HTML and CSS, making it responsive in differents screens sizes. This is a page that show a recipe with their instructions to prepare it. The design was provided by devChallenges.io.",
    "demo": "https://admiring-fermat-5cdbf0.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Recipe_page",
    "image": "img/project_3.jpg"
  },
  {
    "id": 4,
    "name": "Team Works",
    "tags": ["HTML", "CSS", "RESPONSIVE"],
    "description": "In this project, I have created a page that provide the services of the team work, showing their designs and the team. This is responsive page. The design was provided by devChallenges.io.",
    "demo": "https://happy-torvalds-838f92.netlify.app/#our-works",
    "code": "https://github.com/ProjectXfire/devChallenges_Edie_homepage",
    "image": "img/project_4.jpg"
  },
  {
    "id": 5,
    "name": "Check out Form",
    "tags": ["REACT", "RESPONSIVE"],
    "description": "In this project, I have created a form where you can fill your data and add the quantity of the two products, you will see the total amount according to the price and quantity. All the fields are validated, thats mean, if you do not fill one, this will turn red. The design was provided by devChallenges.io.",
    "demo": "https://vigorous-jang-34d0bc.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Checkout",
    "image": "img/project_5.jpg"
  },
  {
    "id": 6,
    "name": "Petgram",
    "tags": ["REACT", "WEBPACK", "RESPONSIVE"],
    "description": "In this project, I have create a petgram page following of Advanced React course in PLatzi. This show a list of animal's photos, a like button and a category filter. If you want to 'like' a photo, you need to register first. The Api was provide by the instructor. The design was provided by Platzi.",
    "demo": "https://petgram-client-six.vercel.app/",
    "code": "https://github.com/ProjectXfire/Petgram-client",
    "image": "img/project_6.jpg"
  },
  {
    "id": 7,
    "name": "Job Search",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "In this project, I have create a Job Search. It Show a list of jobs by default in the city of New York, you can change it using the radio buttons or in the input search. Each job in the list show a brief detail and when it was posted. If you wan to see the detail, please click in the job. It will open another page and you will see all the description of it. The API used is themuse.",
    "demo": "https://hardcore-jennings-eb7c96.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Jobs",
    "image": "img/project_8.jpg"
  },
  {
    "id": 8,
    "name": "Buttons Styles",
    "tags": ["REACT"],
    "description": "This project show a list of buttons styles than you can select according to your needs. It was build in react, using styled-components for the different types of buttons Styled-components help me a little more easier to change the style according to the attribute sing props to validate each case. For the icon I have use the library React-Icons, to use icons just put the correct name according to the documentation.",
    "demo": "https://thirsty-rosalind-7092d5.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_My_Buttons_Styles",
    "image": "img/project_9.jpg"
  },
  {
    "id": 9,
    "name": "Inputs Styles",
    "tags": ["REACT"],
    "description": "This project show a list of inputs styles than you can select according to your needs. It was build in react, using styled-components for the different types of inputs. Styled-components help me a little more easier to change the style according to the attribute, using props to validate each case. For the icon I have use the library React-Icons, to use icons just put the correct name according to the documentation.",
    "demo": "https://lucid-darwin-2328b7.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_My_Inputs_Styles",
    "image": "img/project_10.jpg"
  },
  {
    "id": 10,
    "name": "Windbnb",
    "tags": ["REACT", "RESPONSIVE"],
    "description": "This project show a list of properties, with theirs descriptions. You can filters properties by location & numbers of guests. In the top there is a search icon that you can click in it and it will open a menu, you can select the location and guests, then click in search. If you want to clean the search only click in the button clean. To close the menu only click in the cross icon or in the opaque screen that is below.",
    "demo": "https://heuristic-kowalevski-cfddf9.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Windbnb",
    "image": "img/project_11.jpg"
  },
  {
    "id": 11,
    "name": "todo",
    "tags": ["REACT"],
    "description": "In this project you can create a list of tasks, checked each task when is completed and a menu to see the pendings and completed tasks. You have the option to remove the task also. To save the data I have used the JSON-SERVER (local database). You can test the project without run the server too. The project is responsive. That I have learned was how to configure the JSON-SERVER. First create the file .json and finally run the following command ---> npx json-server --watch data/db.json --port 8000, the part 'data/db,json' depend where the file is located and the name.",
    "demo": "https://suspicious-liskov-efa29b.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Todo",
    "image": "img/project_12.jpg"
  },
  {
    "id": 12,
    "name": "Quotes Generator",
    "tags": ["REACT", "RESPONSIVE"],
    "description": "This project generate a random quote using the api 'QuoteGarden'. When you load the page it will show a random quote from any person, there is a buttom on the top of the page to generate another random quote. If you want to see more quotes of the same person, only click in the block where the name appears. This will show a list of quotes. The page is responsive.",
    "demo": "https://adoring-kirch-8f2f82.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Quote_Generator",
    "image": "img/project_13.jpg"
  },
  {
    "id": 13,
    "name": "My Unsplash",
    "tags": ["NEXTJS", "REACT", "RESPONSIVE"],
    "description": "This project show a list of photos that you can create using a correct URL. You will see the photo created at first. You can search a photo by its label. The page is responsive and for mobile I have used a sidebar that is opened using a hamburger botton. If you want to delete a photo you can put the mouse over it, and then select delete, it will asking you the password, the password is that you used when you create the photo.",
    "demo": "https://617ad2d91030f91b66df0cbe--affectionate-perlman-d9ad54.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_My_Unsplash_FE",
    "image": "img/project_14.jpg"
  },
  {
    "id": 14,
    "name": "WikiCat",
    "tags": ["NEXTJS", "REACT", "RESPONSIVE"],
    "description": "This project is a wikipedia of cats, you can see the description of many cat breeds. In the main page you will see a dropdown menu that you can select the breed and see the detail, for responsive, it is a button that will open a sidebar in the top, and you can select the breed. There is a section to see the top 10 of cats, in this case only will show the first 10 cats from the API response. And finally, the benefits section, in it will show any benefits if you decide to have a cat. The API used is thecatapi.",
    "demo": "https://dev-challenges-catwiki.vercel.app",
    "code": "https://github.com/ProjectXfire/devChallenges_catwiki",
    "image": "img/project_15.jpg"
  },
  {
    "id": 15,
    "name": "Crypto App",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This project show a cryptocurrency Batatabit. All you need about this and its plans.",
    "demo": "https://unruffled-williams-456887.netlify.app/",
    "code": "https://github.com/ProjectXfire/platzi_Cripto_App",
    "image": "img/project_16.jpg"
  },
  {
    "id": 16,
    "name": "Upload Images",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This project you can upload any image that you want, the limit of each image is 200kb, if you exceed this limit, the app will show a warning message. You hace 2 way to upload an image, the first is using the upload buttom or drag & drop the image in the box, after that will show a loading bar and you will redirect to the main page where you see the image uploaded.",
    "demo": "https://frosty-ritchie-cd7fa3.netlify.app/",
    "code": "https://github.com/ProjectXfire/devChallenges_Upload_Image_FE",
    "image": "img/project_17.jpg"
  },
  {
    "id": 17,
    "name": "E-commerce",
    "tags": ["ANGULAR", "RESPONSIVE"],
    "description": "This project is a small e-commerce with ramdom images, developer in angular, you can create a account, see you profile, and add products to your cart, add the quantity and see the total of your purchase.",
    "demo": "https://determined-boyd-3ed7ff.netlify.app/home",
    "code": "https://github.com/ProjectXfire/platzi_angular_ecommerce",
    "image": "img/project_18.jpg"
  },
  {
    "id": 18,
    "name": "Login App",
    "tags": ["ANGULAR", "RESPONSIVE"],
    "description": "This project is a login page, you can create your own account or login using oauth, you have three options, google, facebook and github. When the account is created you can see the detail of it and change some values, for example the photo. If you want to close the session, in the top menu there is a down arrow that will display dropdown, select the logout option.",
    "demo": "https://cranky-mirzakhani-fe9180.netlify.app/login",
    "code": "https://github.com/ProjectXfire/devChallenges_authentication",
    "image": "img/project_19.jpg"
  },
  {
    "id": 20,
    "name": "Thullo App",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This project is a tasks list progression. You can create a board and decided if this will be public or private, you can change it once it is created.\nIn the board, you can create the differents list that will content the tasks, add or remove members, assign permissions and add a board description.\nIn the task, you can will move it into the differents list, add or remove the responsible person, add a cover, add labels, add attachments, add a description and add comments.",
    "demo": "https://comfy-manatee-d1a101.netlify.app/login",
    "code": "https://github.com/ProjectXfire/devChallenges_Thullo",
    "image": "img/project_21.jpg"
  },
  {
    "id": 21,
    "name": "Journal App",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This project is a small journal. You can create your own notes and adding an image. You can create a new user or login using a login social.",
    "demo": "https://udemy-journal.vercel.app/auth/login",
    "code": "https://github.com/ProjectXfire/udemy_journal",
    "image": "img/project_22.jpg"
  },
  {
    "id": 22,
    "name": "Basic React Apps",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This app content many simple proyects, like lists, modals, menus, sidebar, etc.",
    "demo": "https://basic-projects.vercel.app/",
    "code": "https://github.com/ProjectXfire/basic_projects",
    "image": "img/project_23.jpg"
  },
  {
    "id": 23,
    "name": "Advanced React Apps",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This app content some advanced proyects, like search, pagination, infinite scroll, etc.",
    "demo": "https://advanced-proyects.vercel.app/",
    "code": "https://github.com/ProjectXfire/advanced_proyects",
    "image": "img/project_24.jpg"
  },
  {
    "id": 24,
    "name": "My Journal",
    "tags": ["REACT", "NEXTJS", "RESPONSIVE"],
    "description": "This app is a simple journal, you can writes notes and add images if you prefer.",
    "demo": "https://my-journal-rnp5.vercel.app/login",
    "code": "https://github.com/ProjectXfire/my_journal",
    "image": "img/project_25.jpg"
  }
]
